// pages/courier/courier.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    array: [{'订单号':'123','地址':'五山东十','手机号':'1234'}, 
            {'订单号':'124','地址':'五山东三','手机号':'1278'},
            {'订单号':'125','地址':'五山东五','手机号':'6878'}, 
            {'订单号':'126','地址':'五山东二','手机号':'2345'}, 
            {'订单号':'127','地址':'五山东一','手机号':'3567'},  
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})